The desired resource type which external resources should match.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ExternalResourceType ResourceType { get; }
  Visual Basic
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
  Visual C++
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
 See Also
  ExternalResourceMatchOptions Class
  Autodesk.Revit.DB Namespace